-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- 생성 시간: 20-12-17 15:08
-- 서버 버전: 10.4.14-MariaDB
-- PHP 버전: 7.4.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 데이터베이스: `wlsdn6609`
--

-- --------------------------------------------------------

--
-- 테이블 구조 `board`
--

CREATE TABLE `board` (
  `num` int(11) NOT NULL,
  `id` varchar(30) NOT NULL,
  `title` varchar(50) NOT NULL,
  `contents` varchar(255) NOT NULL,
  `date` date NOT NULL,
  `viewer` int(11) NOT NULL,
  `good` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4;

--
-- 테이블의 덤프 데이터 `board`
--

INSERT INTO `board` (`num`, `id`, `title`, `contents`, `date`, `viewer`, `good`) VALUES
(7, '20164128', '테스트', '잘 들어가나유?', '2020-12-14', 11, 0),
(8, 'test용', '글이 잘 써지는지 봅시당', '아주 잘써지네요~ 잘했어요', '2020-12-17', 0, 0);

-- --------------------------------------------------------

--
-- 테이블 구조 `member`
--

CREATE TABLE `member` (
  `name` char(20) NOT NULL,
  `id` char(20) NOT NULL,
  `pass` char(255) NOT NULL,
  `num` char(20) NOT NULL,
  `email` char(20) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4;

--
-- 테이블의 덤프 데이터 `member`
--

INSERT INTO `member` (`name`, `id`, `pass`, `num`, `email`) VALUES
('고성화', '20164129', '353bedbd09a20a81b55ed3d7300a9c2e', '01026338851', 'hya980212@naver.com'),
('윤다연', '20184173', '81dc9bdb52d04dc20036dbd8313ed055', '01012341234', 'ydy4688@sch.com'),
('텟', 'admin', '21232f297a57a5a743894a0e4a801fc3', '12345678010', 'ccc@ccc.ccc'),
('test', 'test2', 'a8f5f167f44f4964e6c998dee827110c', '01012345678', 'asdasd@naver.com'),
('테스트', 'test', '16d7a4fca7442dda3ad93c9a726597e4', '01012345678', 'test@test.com'),
('윤다연', 'ydy4688', 'a384b6463fc216a5f8ecb6670f86456a', '01012341234', 'ydy4688@sch.com'),
('윤다연', 'asdf', '912ec803b2ce49e4a541068d495ab570', '01012341234', 'ydy4688@sch.ac.kr'),
('조성빈', 'been1234', '827ccb0eea8a706c4c34a16891f84e7b', '01075077840', 'been97811@naver.com'),
('고성화', 'ddddd', '81dc9bdb52d04dc20036dbd8313ed055', '01026338851', 'hya980212@naver.com'),
('최서희', 'wlsdn6609', '54244fb5e8b7d675d5f9837d1da7e8da', '01056417602', 'choe@naver.com'),
('asfasd', 'fgrasdf', 'a8f5f167f44f4964e6c998dee827110c', '01012345678', 'asdasd@naver.com'),
('조성빈', '20164140', '827ccb0eea8a706c4c34a16891f84e7b', '01075077840', 'been97811@naver.com'),
('조성우', 'chosw', '827ccb0eea8a706c4c34a16891f84e7b', '01053043795', 'sung_wooc@yahoo.com'),
('신진우', '20164128', 'a8f5f167f44f4964e6c998dee827110c', '01012345678', 'asdasd@naver.com'),
('asdasd', 'test용', 'a8f5f167f44f4964e6c998dee827110c', '01012345678', 'asdasd@naver.com');

-- --------------------------------------------------------

--
-- 테이블 구조 `sale`
--

CREATE TABLE `sale` (
  `num` int(11) NOT NULL,
  `id` varchar(30) NOT NULL,
  `title` varchar(50) NOT NULL,
  `contents` varchar(255) NOT NULL,
  `date` date NOT NULL,
  `viewer` int(11) NOT NULL,
  `good` int(11) NOT NULL,
  `area` int(11) NOT NULL,
  `price` varchar(255) NOT NULL,
  `tel` char(20) NOT NULL,
  `lat` double NOT NULL,
  `lng` double NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4;

--
-- 테이블의 덤프 데이터 `sale`
--

INSERT INTO `sale` (`num`, `id`, `title`, `contents`, `date`, `viewer`, `good`, `area`, `price`, `tel`, `lat`, `lng`) VALUES
(1, 'admin', '럭셔리빌', '풀옵션, 공용정수기 이용, 침대 설치', '2020-10-07', 96, 13, 1, '년세 420, 한학기 220 / 보증금 20만원', '010-3397-0566', 36.773434039685604, 126.93191459791583),
(2, 'admin', '레드빌', '풀옵션, CCTV 설치, 승강기, 디지털 도어락, 주차 가능', '2020-01-04', 41, 2, 1, '집주인과 상의 후 결정', '010-5322-8565', 36.77381606934398, 126.93217435743672),
(3, 'admin', '리치빌', '풀옵션, CCTV 설치, 침대, 주차 가능', '2019-11-27', 71, 6, 1, '년세 420만원', '010-5431-7241', 36.77303894674399, 126.93226751325831),
(4, 'admin', '베스트빌_별관', '풀옵션, 침대, 디지털 도어락, 주차 가능', '2020-02-27', 46, 7, 1, '한 학기 200', '011-311-3563', 36.77710374971175, 126.93274845558707),
(5, 'admin', '베스트빌_본관', '풀옵션, CCTV 설치, 공용 정수기, 침대, 주차 가능', '2019-12-03', 11, 4, 1, '440만원(2인), 보증금 20만원', '010-2438-0904', 36.77334093385317, 126.93274845558707),
(6, 'admin', '삼성오피스텔', '풀옵션, 침대', '2020-03-05', 9, 3, 1, '년세 360만원 / 보증금 20만원', '010-8824-3840', 36.77335675811362, 126.9321063267514),
(7, 'admin', '센텀빌', '풀옵션, CCTV 설치, 승강기 설치', '2020-07-06', 9, 0, 1, '전세 5000, 보증금 20 / 년세 430 작은방 410', '010-4311-1421', 36.7738182122826, 126.93254818257316),
(8, 'admin', '벧엘관', '풀옵션, 공용 정수기, 침대, 공과금 포함, 디지털 도어락, 주차 가능', '2019-02-13', 15, 0, 2, '년세 280 (큰 방은 290), 반년세 140', '010-9420-7766', 36.77242803630948, 126.92895318442272),
(9, 'admin', '복동원룸', '풀옵션, 침대', '2020-08-23', 13, 3, 2, '1년 230-260 / 보증금 X', '010-3200-7457', 36.77389046305493, 126.93042878257317),
(10, 'admin', '아모르빌A', '풀옵션, 침대', '2020-11-04', 21, 2, 2, '년세 : 440(10평), 400(8평) / 보증금 30\r\n반년세 : 220(10평), 200(8평) / 보증금 30\r\n월세 : 38(10평), 35(8평) / 보증금 120', '010-3261-6882', 36.779464990661864, 126.9406269880497),
(11, 'admin', '에어플러스빌1', '풀옵션, 침대, 디지털 도어락, 주차 가능', '2020-10-12', 10, 0, 2, '1인실 : 420 / 450, 2인실 : 490 / 투룸 : 700', '010-3650-9417', 36.7715741797482, 126.92899668257316),
(12, 'admin', '엘림오피스텔', '풀옵션, 침대', '2020-08-11', 9, 0, 2, '1년 360 (1인 추가 시 30), 보증금 10', '010-4140-5705', 36.7719705086308, 126.92965771140875),
(13, 'admin', '파란들집', '풀옵션, 침대', '2020-08-12', 9, 0, 2, '연 260 (전기세, 관리비, 난방비 포함)', '010-9455-6969', 36.772128848988636, 126.9289012402444),
(14, 'admin', '남산원룸', '풀옵션, 공용 정수기, 침대, 공용 세탁기, 주차 가능', '2018-07-22', 1, 0, 3, '작은방 : 200 / 큰방 : 250 / 보증금 X', '041-542-6992', 36.775677703643076, 126.93438626908006),
(15, 'admin', '오성원원룸', '공용 정수기, 침대, 공용 세탁기', '2018-11-20', 3, 1, 3, '보증금 : 100 / 월세 : 30 / 전세 : 3000', '010-8826-9848', 36.777943887396574, 126.93174276908024),
(16, 'admin', '템플', '공용 정수기, 침대, 주차 가능', '2019-07-08', 161, 1, 3, '280 (1인 추가 시 20) / 보증금 10', '010-2594-8571', 36.77656810244497, 126.93222322490192),
(17, 'admin', '학사관', '풀옵션, 침대', '2018-07-22', 4, 0, 3, '1년 200-220 / 보증금 X', '011-426-8914', 36.77775493511201, 126.93380322490192),
(18, 'admin', '강남빌', '풀옵션, CCTV 설치, 승강기, 침대, 디지털 도어락', '2020-11-12', 17, 0, 4, '전세 / 년세 : 445 / 학기 : 230 / 보증금 : 20', '010-8480-4431', 36.77526902555647, 126.93430736867967),
(19, 'admin', '수지빌', '풀옵션, 침대', '2020-01-29', 4, 0, 4, '1인실 : 400 / 2인실 : 420 / 보증금 : 20', '010-8746-6910', 36.773435159856305, 126.93482467727192),
(20, 'admin', '이안오피스텔', '풀옵션, 침대, 디지털 도어락', '2020-02-11', 9, 1, 4, '1년 350 / 보증금 : 20', '010-5414-5428', 36.77485067350357, 126.93439062490185),
(21, 'admin', '크레파스빌', '풀옵션, 침대', '2018-07-22', 3, 0, 4, '400 / 보증금 : 20', '010-7315-1961', 36.77400050750243, 126.93553842675162),
(22, 'admin', '행복한집', '풀옵션, 공용 정수기, 침대', '2019-01-07', 3, 0, 4, '년 400 / 한학기 210', '010-8996-7953', 36.773832, 126.931951);

--
-- 덤프된 테이블의 인덱스
--

--
-- 테이블의 인덱스 `board`
--
ALTER TABLE `board`
  ADD PRIMARY KEY (`num`),
  ADD KEY `id` (`id`);

--
-- 테이블의 인덱스 `member`
--
ALTER TABLE `member`
  ADD PRIMARY KEY (`id`);

--
-- 테이블의 인덱스 `sale`
--
ALTER TABLE `sale`
  ADD PRIMARY KEY (`num`);

--
-- 덤프된 테이블의 AUTO_INCREMENT
--

--
-- 테이블의 AUTO_INCREMENT `board`
--
ALTER TABLE `board`
  MODIFY `num` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- 테이블의 AUTO_INCREMENT `sale`
--
ALTER TABLE `sale`
  MODIFY `num` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
